RudolphRiedel/FT800-FT813/example_projects/EVE_Test_SAME51_DMA_EVE3-43G/EVE_target.h
			static inline void spi_transmit_async(uint8_t data)
			{
				SPI_ReceiveByte(data);
			}

			static inline void spi_transmit(uint8_t data)
			{
				SPI_ReceiveByte(data);
			}

			static inline uint8_t spi_receive(uint8_t data)
			{
				return SPI_ReceiveByte(data);
			}

			static inline uint8_t fetch_flash_byte(const uint8_t *data)
			{
				return *data;
			}

		#endif /* __TRICORE__ */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

		#if defined (__SAMC21E18A__) || (__ATSAMC20G17A__) || (__SAME51J19A__) || (__SAMD51P20A__) || (__SAMD51J19A__) || (__SAMD51G18A__)
		/* note: target as set by AtmelStudio, valid  are all from the same family, ATSAMC2x and ATSAMx5x use the same SERCOM units */

		#include "sam.h"

		#if defined (__SAMC21E18A__) || (__ATSAMC20G17A__)
		#define EVE_CS_PORT 0
		#define EVE_CS PORT_PA05
		#define EVE_PDN_PORT 0
		#define EVE_PDN PORT_PA03
		#define EVE_SPI SERCOM0
		#define EVE_SPI_DMA_TRIGGER SERCOM0_DMAC_ID_TX
		#define EVE_DMA_CHANNEL 0
		#define EVE_DMA
		#define EVE_DELAY_1MS 8000	/* ~1ms at 48MHz Core-Clock */
		#endif

		#if defined (__SAME51J19A__) || (__SAMD51P20A__) || (__SAMD51J19A__) || (__SAMD51G18A__)
		#define EVE_CS_PORT 1
		#define EVE_CS PORT_PB01
		#define EVE_PDN_PORT 1
		#define EVE_PDN PORT_PB31
		#define EVE_SPI SERCOM5
		#define EVE_SPI_DMA_TRIGGER SERCOM5_DMAC_ID_TX
		#define EVE_DMA_CHANNEL 0
		#define EVE_DMA
		#define EVE_DELAY_1MS 20000	/* ~1ms at 120MHz Core-Clock and activated cache, according to my Logic-Analyzer */
		#endif


		#if defined (EVE_DMA)
			extern uint8_t EVE_dma_buffer[4100];
			extern volatile uint16_t EVE_dma_buffer_index;
			extern volatile uint8_t EVE_dma_busy;

			void EVE_init_dma(void);
			void EVE_start_dma_transfer(void);
		#endif

		void DELAY_MS(uint16_t val);


		static inline void EVE_pdn_set(void)
		{
			PORT->Group[EVE_PDN_PORT].OUTCLR.reg = EVE_PDN;
		}

		static inline void EVE_pdn_clear(void)
		{
			PORT->Group[EVE_PDN_PORT].OUTSET.reg = EVE_PDN;
		}

		static inline void EVE_cs_set(void)
		{
			PORT->Group[EVE_CS_PORT].OUTCLR.reg = EVE_CS;
		}

		static inline void EVE_cs_clear(void)
		{
			PORT->Group[EVE_CS_PORT].OUTSET.reg = EVE_CS;
		}

		static inline void spi_transmit_async(uint8_t data)
		{
			#if defined (EVE_DMA)
				EVE_dma_buffer[EVE_dma_buffer_index++] = data;
			#else
				EVE_SPI->SPI.DATA.reg = data;
				while((EVE_SPI->SPI.INTFLAG.reg & SERCOM_SPI_INTFLAG_TXC) == 0);
				(void) EVE_SPI->SPI.DATA.reg; /* dummy read-access to clear SERCOM_SPI_INTFLAG_RXC */
			#endif
		}

		static inline void spi_transmit(uint8_t data)
		{
			EVE_SPI->SPI.DATA.reg = data;
			while((EVE_SPI->SPI.INTFLAG.reg & SERCOM_SPI_INTFLAG_TXC) == 0);
			(void) EVE_SPI->SPI.DATA.reg; /* dummy read-access to clear SERCOM_SPI_INTFLAG_RXC */
		}

		static inline uint8_t spi_receive(uint8_t data)
		{
			EVE_SPI->SPI.DATA.reg = data;
			while((EVE_SPI->SPI.INTFLAG.reg & SERCOM_SPI_INTFLAG_TXC) == 0);
			return EVE_SPI->SPI.DATA.reg;
		}

		static inline uint8_t fetch_flash_byte(const uint8_t *data)
		{
			return *data;
		}

		#endif /* SAMC2x / SAMx5x */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

		#if defined (__riscv)

//		#warning Compiling for GD32VF103CBT6

		#include "gd32vf103.h"

		static inline void DELAY_MS(uint16_t val)
		{
			uint16_t counter;

			while(val > 0)
			{
				for(counter=0; counter < 18000;counter++) /* ~1ms at 108MHz Core-Clock, according to my Logic-Analyzer */
				{
					__asm__ volatile ("nop");
				}
				val--;
			}
		}

		static inline void EVE_pdn_set(void)
		{
			gpio_bit_reset(GPIOB,GPIO_PIN_1);
		}

		static inline void EVE_pdn_clear(void)
		{
			gpio_bit_set(GPIOB,GPIO_PIN_1);
		}

		static inline void EVE_cs_set(void)
		{
			gpio_bit_reset(GPIOB,GPIO_PIN_0);
		}

		static inline void EVE_cs_clear(void)
		{
			gpio_bit_set(GPIOB,GPIO_PIN_0);
		}

		static inline void spi_transmit_async(uint8_t data)
		{
			#if defined (EVE_DMA)
				EVE_dma_buffer[EVE_dma_buffer_index++] = data;
			#else
				SPI_DATA(SPI0) = (uint32_t) data;
				while(SPI_STAT(SPI0) & SPI_STAT_TRANS);
			#endif
		}

		static inline void spi_transmit(uint8_t data)
		{
				SPI_DATA(SPI0) = (uint32_t) data;
				while(SPI_STAT(SPI0) & SPI_STAT_TRANS);
		}

		static inline uint8_t spi_receive(uint8_t data)
		{
				SPI_DATA(SPI0) = (uint32_t) data;
				while(SPI_STAT(SPI0) & SPI_STAT_TRANS);
				return (uint8_t) SPI_DATA(SPI0);
		}

		static inline uint8_t fetch_flash_byte(const uint8_t *data)
		{
			return *data;
		}

		#endif /* __riscv */

/*----------------------------------------------------------------------------------------------------------------*/
/*----------------------------------------------------------------------------------------------------------------*/

		#if defined (STM32L073xx) || (STM32F1) || (STM32F207xx) || (STM32F3) || (STM32F4)

		#if defined (STM32L073xx) /* set by PlatformIO board definition file nucleo_l073z.json */
		#include "stm32l0xx.h"
		#include "stm32l0xx_hal.h"
		#include "stm32l0xx_ll_spi.h"
		#endif

		#if defined (STM32F1) /* set by PlatformIO board definition file genericSTM32F103C8.json */
		#include "stm32f1xx.h"
		#include "stm32f1xx_hal.h"
		#include "stm32f1xx_ll_spi.h"
		#endif

		#if defined (STM32F207xx) /* set by PlatformIO board definition file nucleo_f207zg.json */
		#include "stm32f2xx.h"
		#include "stm32f2xx_hal.h"
		#include "stm32f2xx_ll_spi.h"
		#endif

		#if defined (STM32F3) /* set by PlatformIO board definition file genericSTM32F303CB.json */
		#include "stm32f3xx.h"
		#include "stm32f3xx_hal.h"
		#include "stm32f3xx_ll_spi.h"
		#endif

		#if defined (STM32F4) /* set by PlatformIO board definition file genericSTM32F407VET6.json */
		#include "stm32f4xx.h"
		#include "stm32f4xx_hal.h"
		#include "stm32f4xx_ll_spi.h"
		#endif


